[
  {
    "date": "2016-05-26",
    "description": [
      "Moved to SF from Raleigh, NC to begin the Hack Reactor software engineering immersive."
    ],
    "eventId": "1mv2",
    "layout": null,
    "location": "San Francisco, CA",
    "name": "Moved To San Francisco",
    "photos": [],
    "type": "Life",
    "uuid": "test001-cd94-4187-ab6f-e201289724af"
  }, {
    "date": "2017-01-03",
    "description": [
      "Accepted offer to work at Robert Half Technology, beginning January 2017."
    ],
    "eventId": "2kk1",
    "layout": null,
    "location": "San Ramon, CA",
    "name": "Began Work At Robert Half",
    "photos": [],
    "type": "Professional",
    "uuid": "test0002-c08e-4be6-9459-51cf632a2e79"
  }, {
    "date": "1991-10-13",
    "description": [
      "The day I came into this world. Alas... to be alive!"
    ],
    "eventId": "3ihl",
    "layout": "grid",
    "location": "Jonesboro, AK",
    "name": "Date of Birth",
    "photos": [],
    "type": "Life"
  }, {
    "date": "2010-08-17",
    "description": [
      "Started university majoring in polymer chemistry and with ambitions of becoming a research scientist."
    ],
    "eventId": "441k",
    "layout": null,
    "location": "Chapel Hill, NC",
    "name": "Began School At The University of North Carolina at Chapel Hill",
    "photos": [],
    "type": "Education"
  }, {
    "date": "2016-08-26",
    "description": [
      "Date of matriculation from the world's premier software engineering immersive — Hack Reactor! Here I received my first true exposure to what the world of software engineering is really about. Divided into two distinct parts, the HR program begins with a grueling six-week onslaught of video and instructor-led lectures, gating student assessments and topical paired code sprints.",
      "The 'juniors', as students of the first half of the program are known, then transition into the thesis portion of the program. The intent behind this phase is to develop a Full-Stack application that, ultimately, may serve as a testament to the student's evolution as a developer, résumé padding and content for discussion in interviews."
    ],
    "eventId": "5kso",
    "layout": null,
    "location": "San Francisco, CA",
    "name": "Graduated From Hack Reactor",
    "photos": [],
    "type": "Education",
    "uuid": "test0003-c1b8-4835-8caa-1568f1e5531c"
  }
]
